### W3. 3.Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.DataFrame([])

In [3]:
df.dropna?

In [5]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                  [3,4,np.nan,1],
                  [np.nan,np.nan,np.nan,5]],
                 columns = list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [6]:
df.dropna(axis=0, how='all')  #  특정 행이 전부 null 이면 drop

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [7]:
df.dropna(axis=1, how='all')  #  특정 열이 전부 null 이면 drop (C가 해당되어 drop 됨)

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [8]:
df.dropna(axis=0, how='any') #  특정 행에서 하나라도 null 이면 drop (모든 행이 해당되어 drop)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [10]:
df.dropna(axis=1, how='any')   #  특정 열에서 하나라도 null 이면 drop (D를 제외하고 모든 열이 해당되어 drop)

   D
0  0
1  1
2  5

In [11]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [12]:
df.fillna(0)  # null 값을 0으로 채움

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [13]:
values = {'A':0,'B':1,'C':2, 'D':3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [14]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [15]:
df['A'].mean()

3.0

In [16]:
df['D'].mean()

2.0

In [17]:
df.fillna(df['D'].mean())

     A    B    C  D
0  2.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  2.0  2.0  2.0  5

In [18]:
df['D'].median()

1.0

In [19]:
df.fillna(df['D'].median())

     A    B    C  D
0  1.0  2.0  1.0  0
1  3.0  4.0  1.0  1
2  1.0  1.0  1.0  5

In [20]:
fill_na_max=df['D'].max()
fill_na_max

5

In [21]:
df.fillna(fill_na_max)

     A    B    C  D
0  5.0  2.0  5.0  0
1  3.0  4.0  5.0  1
2  5.0  5.0  5.0  5

In [23]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [22]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [24]:
df.isnull().sum()

A    2
B    1
C    3
D    0
dtype: int64

In [25]:
df.notnull().sum()

A    1
B    2
C    0
D    3
dtype: int64